---
kind: type
id: T:Autodesk.Revit.DB.Electrical.CableTrayRun
source: html/f539c52d-999a-0164-d951-b26701ad2884.htm
---
# Autodesk.Revit.DB.Electrical.CableTrayRun

This class represents a cable tray run in Autodesk Revit.

## Syntax (C#)
```csharp
public class CableTrayRun : CableTrayConduitRunBase
```

## Remarks
This class is mainly for calculating length of a cable tray run.
 A cable tray run contains connected straight cable tray segments and bends between the straight segments with same type and size.